2013/migratie 2013-02-13/migr-isc/bin/jbossesb-4.10-cp1-installer/samples/quickstarts/webservice_producer/src/org/jboss/soa/esb/samples/quickstart/webserviceproducer/test/soap_message_01.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:good="http://webservice_producer/goodbyeworld">
   <soapenv:Header/>
   <soapenv:Body>
      <good:sayGoodbye>
         <message>Goodbye!!</message>
      </good:sayGoodbye>
   </soapenv:Body>
</soapenv:Envelope>